status/2023/0310.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-11 Sat 06:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>04 March 2023 - 10 March 2023</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">04 March 2023 - 10 March 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2cdee54">1. MIT OCW</a>
<ul>
<li><a href="#org19301fe">1.1. 18.03sc (differential equations).</a>
<ul>
<li><a href="#org2bde979">1.1.1. Unit I - Complex Arithmetic and Exponentials</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org545b0aa">2. Ada/SPARK</a>
<ul>
<li><a href="#org0aa2081">2.1. GCC Abandoned</a></li>
</ul>
</li>
<li><a href="#org1e14533">3. Telechron clock</a></li>
<li><a href="#org84dd9bd">4. Mill Controller #2</a>
<ul>
<li><a href="#org1244f12">4.1. Mounted on mill - ready or testing</a></li>
<li><a href="#orgb72a3c8">4.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orgea25735">4.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org2aec986">4.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
<li><a href="#org024bff2">4.3. Alternative architecture</a>
<ul>
<li><a href="#org7eaf4df">4.3.1. Split off stepper motor controller to separate board</a></li>
<li><a href="#org496f3c0">4.3.2. Use emc2 MODBUS/TCP protocol for stepper and other IO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0c36450">5. Alum Rock Data Center</a>
<ul>
<li><a href="#orgd1809d3">5.1. need to check rocky, others? (arch?) for suitability</a></li>
<li><a href="#org74026ca">5.2. recheck ALMA, now that CERN and Fermilab are using it</a></li>
</ul>
</li>
<li><a href="#org410221d">6. Virtual Orchestra</a>
<ul>
<li><a href="#orga2a5d56">6.1. sfz file tests</a>
<ul>
<li><a href="#orgb94fa3f">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#orga22d3dd">6.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#orgdd5f483">6.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#org13502d3">6.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#org7ce73fe">7. gat</a>
<ul>
<li><a href="#org0415335">7.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#orgc0a0fbc">8. RIOT drivers</a>
<ul>
<li><a href="#org874ad54">8.1. WS2801</a></li>
<li><a href="#org25a0cba">8.2. Velleman KA03</a></li>
<li><a href="#orgd86e2e9">8.3. Velleman KA05</a></li>
</ul>
</li>
<li><a href="#org5f32074">9. mcd05 32 button/led box</a>
<ul>
<li><a href="#org5d77dec">9.1. Recovered schematics.</a></li>
<li><a href="#org6192407">9.2. Planning software.</a></li>
<li><a href="#org07655a7">9.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#org47b9302">9.3.1. Test program running.</a></li>
<li><a href="#org0c2299c">9.3.2. Need to consider CoAP multicast discovery.</a></li>
<li><a href="#org05042fe">9.3.3. Consider simpler architecture with STM32F767 as a 'hub'.</a></li>
<li><a href="#org50380fb">9.3.4. Consider CAN interface to hub.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge6fe3b0">10. AMD 2900 bitslice computing</a>
<ul>
<li><a href="#org7dcaeef">10.1. Probably my oldest uncompleted project</a></li>
<li><a href="#orgc660232">10.2. Exploring possibilities for something constructive</a></li>
</ul>
</li>
<li><a href="#orgf4a1199">11. Hitachi HD68B09E CPU</a>
<ul>
<li><a href="#org7eca88a">11.1. RAM/UART/IO</a></li>
<li><a href="#orga404a28">11.2. Started schematic</a>
<ul>
<li><a href="#org4e1f398">11.2.1. Standard peripheral set for 8 bit CPU bringups</a></li>
</ul>
</li>
<li><a href="#org2fc0cf8">11.3. Arduino Mega 2560 DMA loader</a></li>
<li><a href="#org171878b">11.4. Generate quadrature clock directly</a></li>
<li><a href="#orgecca1b1">11.5. Full Bus SW Emulation infeasible</a></li>
</ul>
</li>
<li><a href="#org450182e">12. Rockwell R65F11</a>
<ul>
<li><a href="#orgf0fb340">12.1. Still evaluating.</a></li>
<li><a href="#org436258c">12.2. Dev board</a></li>
</ul>
</li>
<li><a href="#org5de8186">13. PLD programming</a></li>
<li><a href="#org2661ab8">14. EPROM Programming</a></li>
<li><a href="#org3e9d4b5">15. POSIT</a></li>
<li><a href="#org49becb2">16. MAME</a>
<ul>
<li><a href="#org9ed24d9">16.1. Subset builds in debug mode</a></li>
<li><a href="#orgd6e1e6c">16.2. gs6809 serial IO doesn't work right with PTY and other streams</a></li>
<li><a href="#org8714dae">16.3. ampro (Z80/Z80SIO) <b>does</b> work with PTY</a></li>
<li><a href="#org441daf4">16.4. Evaluating what is needed for other emulators.</a></li>
</ul>
</li>
<li><a href="#orgda3b464">17. More project ideas</a>
<ul>
<li><a href="#org9fbb12a">17.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#orgd1d77d2">17.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#org4c8e170">17.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#org4fc30b5">17.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org9a49a3a">17.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org97e574f">17.3. GMPASM assembler</a></li>
<li><a href="#org6ad7e69">17.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org4df509b">17.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgfedd1a7">17.5.1. Offline compilation</a></li>
<li><a href="#org7a4fe66">17.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org25547bf">17.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#orgefc08d3">17.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#org314af3f">17.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#orgad5dd68">17.6.3. CPUs with totally async bus may be supportable without RAM</a></li>
<li><a href="#orgd95e530">17.6.4. Could use small footprint monitor in asm (gmpmon?)</a></li>
</ul>
</li>
<li><a href="#org48294bd">17.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org5915ea8">17.7.1. OSI Superboard</a></li>
<li><a href="#orga0e1947">17.7.2. Super Jolt</a></li>
<li><a href="#orgdd3fd19">17.7.3. Ampro Little Board</a></li>
<li><a href="#org5357f17">17.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgc9469bf">17.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2b03f54">18. David Davies</a>
<ul>
<li><a href="#org1e16acc">18.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org70b6990">18.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org01e0cf9">18.3. Next hearing 3/30/2023</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2cdee54" class="outline-2">
<h2 id="org2cdee54"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org19301fe" class="outline-3">
<h3 id="org19301fe"><span class="section-number-3">1.1.</span> 18.03sc (differential equations).</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2bde979" class="outline-4">
<h4 id="org2bde979"><span class="section-number-4">1.1.1.</span> Unit I - Complex Arithmetic and Exponentials</h4>
</div>
</div>
</div>
<div id="outline-container-org545b0aa" class="outline-2">
<h2 id="org545b0aa"><span class="section-number-2">2.</span> Ada/SPARK</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0aa2081" class="outline-3">
<h3 id="org0aa2081"><span class="section-number-3">2.1.</span> GCC Abandoned</h3>
<div class="outline-text-3" id="text-2-1">
<p>
An apparent mismatch between GCC register model and ACK stack model
preclues an EM backend. Between fighting byte-addressability and
machine models, it appears that working with GCC is a losing battle.
Investigating a more direct approach with a standalone GNAT build
(like gnat-llvm) with <a href="https://github.com/libfirm/libfirm">https://github.com/libfirm/libfirm</a> libfirm for
parse tree and code generation.
</p>
</div>
</div>
</div>
<div id="outline-container-org1e14533" class="outline-2">
<h2 id="org1e14533"><span class="section-number-2">3.</span> Telechron clock</h2>
<div class="outline-text-2" id="text-3">
<p>
After two failed attempts to fix the clock with modern "replacement"
motors (one "drop-in replacement" requited substandial modification
and landed up sounding like a meat grinder) - procured a working 1927
Telechron clock and swapped parts. Success!
</p>
</div>
</div>
<div id="outline-container-org84dd9bd" class="outline-2">
<h2 id="org84dd9bd"><span class="section-number-2">4.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1244f12" class="outline-3">
<h3 id="org1244f12"><span class="section-number-3">4.1.</span> Mounted on mill - ready or testing</h3>
</div>
<div id="outline-container-orgb72a3c8" class="outline-3">
<h3 id="orgb72a3c8"><span class="section-number-3">4.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgea25735" class="outline-4">
<h4 id="orgea25735"><span class="section-number-4">4.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org2aec986" class="outline-4">
<h4 id="org2aec986"><span class="section-number-4">4.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
<div id="outline-container-org024bff2" class="outline-3">
<h3 id="org024bff2"><span class="section-number-3">4.3.</span> Alternative architecture</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org7eaf4df" class="outline-4">
<h4 id="org7eaf4df"><span class="section-number-4">4.3.1.</span> Split off stepper motor controller to separate board</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Increase latency tolerance on controller
</p>
</div>
</div>
<div id="outline-container-org496f3c0" class="outline-4">
<h4 id="org496f3c0"><span class="section-number-4">4.3.2.</span> Use emc2 MODBUS/TCP protocol for stepper and other IO</h4>
</div>
</div>
</div>
<div id="outline-container-org0c36450" class="outline-2">
<h2 id="org0c36450"><span class="section-number-2">5.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd1809d3" class="outline-3">
<h3 id="orgd1809d3"><span class="section-number-3">5.1.</span> need to check rocky, others? (arch?) for suitability</h3>
</div>
<div id="outline-container-org74026ca" class="outline-3">
<h3 id="org74026ca"><span class="section-number-3">5.2.</span> recheck ALMA, now that CERN and Fermilab are using it</h3>
</div>
</div>
<div id="outline-container-org410221d" class="outline-2">
<h2 id="org410221d"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga2a5d56" class="outline-3">
<h3 id="orga2a5d56"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgb94fa3f" class="outline-4">
<h4 id="orgb94fa3f"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-orga22d3dd" class="outline-3">
<h3 id="orga22d3dd"><span class="section-number-3">6.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-orgdd5f483" class="outline-3">
<h3 id="orgdd5f483"><span class="section-number-3">6.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-org13502d3" class="outline-3">
<h3 id="org13502d3"><span class="section-number-3">6.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-6-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-org7ce73fe" class="outline-2">
<h2 id="org7ce73fe"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org0415335" class="outline-3">
<h3 id="org0415335"><span class="section-number-3">7.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-orgc0a0fbc" class="outline-2">
<h2 id="orgc0a0fbc"><span class="section-number-2">8.</span> RIOT drivers</h2>
<div class="outline-text-2" id="text-8">
<p>
Implemented - needs testing.
</p>
</div>
<div id="outline-container-org874ad54" class="outline-3">
<h3 id="org874ad54"><span class="section-number-3">8.1.</span> WS2801</h3>
</div>
<div id="outline-container-org25a0cba" class="outline-3">
<h3 id="org25a0cba"><span class="section-number-3">8.2.</span> Velleman KA03</h3>
</div>
<div id="outline-container-orgd86e2e9" class="outline-3">
<h3 id="orgd86e2e9"><span class="section-number-3">8.3.</span> Velleman KA05</h3>
</div>
</div>
<div id="outline-container-org5f32074" class="outline-2">
<h2 id="org5f32074"><span class="section-number-2">9.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org5d77dec" class="outline-3">
<h3 id="org5d77dec"><span class="section-number-3">9.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org6192407" class="outline-3">
<h3 id="org6192407"><span class="section-number-3">9.2.</span> Planning software.</h3>
</div>
<div id="outline-container-org07655a7" class="outline-3">
<h3 id="org07655a7"><span class="section-number-3">9.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org47b9302" class="outline-4">
<h4 id="org47b9302"><span class="section-number-4">9.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-org0c2299c" class="outline-4">
<h4 id="org0c2299c"><span class="section-number-4">9.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
<div id="outline-container-org05042fe" class="outline-4">
<h4 id="org05042fe"><span class="section-number-4">9.3.3.</span> Consider simpler architecture with STM32F767 as a 'hub'.</h4>
</div>
<div id="outline-container-org50380fb" class="outline-4">
<h4 id="org50380fb"><span class="section-number-4">9.3.4.</span> Consider CAN interface to hub.</h4>
</div>
</div>
</div>
<div id="outline-container-orge6fe3b0" class="outline-2">
<h2 id="orge6fe3b0"><span class="section-number-2">10.</span> AMD 2900 bitslice computing</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org7dcaeef" class="outline-3">
<h3 id="org7dcaeef"><span class="section-number-3">10.1.</span> Probably my oldest uncompleted project</h3>
</div>
<div id="outline-container-orgc660232" class="outline-3">
<h3 id="orgc660232"><span class="section-number-3">10.2.</span> Exploring possibilities for something constructive</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Create verilog models for 2903/2910 and verify against hardware?
</p>
</div>
</div>
</div>
<div id="outline-container-orgf4a1199" class="outline-2">
<h2 id="orgf4a1199"><span class="section-number-2">11.</span> Hitachi HD68B09E CPU</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org7eca88a" class="outline-3">
<h3 id="org7eca88a"><span class="section-number-3">11.1.</span> RAM/UART/IO</h3>
</div>
<div id="outline-container-orga404a28" class="outline-3">
<h3 id="orga404a28"><span class="section-number-3">11.2.</span> Started schematic</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-org4e1f398" class="outline-4">
<h4 id="org4e1f398"><span class="section-number-4">11.2.1.</span> Standard peripheral set for 8 bit CPU bringups</h4>
<div class="outline-text-4" id="text-11-2-1">
<p>
Board schematic planned - need Kicad symbols
</p>
</div>
</div>
</div>
<div id="outline-container-org2fc0cf8" class="outline-3">
<h3 id="org2fc0cf8"><span class="section-number-3">11.3.</span> Arduino Mega 2560 DMA loader</h3>
<div class="outline-text-3" id="text-11-3">
<p>
&#x2026;Along with standard 8 bit loader
</p>
</div>
</div>
<div id="outline-container-org171878b" class="outline-3">
<h3 id="org171878b"><span class="section-number-3">11.4.</span> Generate quadrature clock directly</h3>
</div>
<div id="outline-container-orgecca1b1" class="outline-3">
<h3 id="orgecca1b1"><span class="section-number-3">11.5.</span> Full Bus SW Emulation infeasible</h3>
<div class="outline-text-3" id="text-11-5">
<p>
6809 1000ns maximum cycle time too short
</p>
</div>
</div>
</div>
<div id="outline-container-org450182e" class="outline-2">
<h2 id="org450182e"><span class="section-number-2">12.</span> Rockwell R65F11</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgf0fb340" class="outline-3">
<h3 id="orgf0fb340"><span class="section-number-3">12.1.</span> Still evaluating.</h3>
</div>
<div id="outline-container-org436258c" class="outline-3">
<h3 id="org436258c"><span class="section-number-3">12.2.</span> Dev board</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Reverse engineered some of a mostly fully built development board with
one part missing. As near as I can tell, that one part is some sort of
programmable address decoder with a pinout that does not correspond to
any part I can find. Kind of like a GAL but with inputs on top and
outputs on bottom (as opposed to left and right in a standard GAL). I
have no idea what the provenance of this board is and if it ever
worked.
</p>
</div>
</div>
</div>
<div id="outline-container-org5de8186" class="outline-2">
<h2 id="org5de8186"><span class="section-number-2">13.</span> PLD programming</h2>
<div class="outline-text-2" id="text-13">
<p>
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
</p>
</div>
</div>
<div id="outline-container-org2661ab8" class="outline-2">
<h2 id="org2661ab8"><span class="section-number-2">14.</span> EPROM Programming</h2>
<div class="outline-text-2" id="text-14">
<p>
Found some software for Needham programmer. Need to check electrolytic
caps on ISA board.
</p>
</div>
</div>
<div id="outline-container-org3e9d4b5" class="outline-2">
<h2 id="org3e9d4b5"><span class="section-number-2">15.</span> POSIT</h2>
<div class="outline-text-2" id="text-15">
<p>
Use POSITs for YRX?
</p>
</div>
</div>
<div id="outline-container-org49becb2" class="outline-2">
<h2 id="org49becb2"><span class="section-number-2">16.</span> MAME</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org9ed24d9" class="outline-3">
<h3 id="org9ed24d9"><span class="section-number-3">16.1.</span> Subset builds in debug mode</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Full debug fails - not enough disk or memory.
</p>
</div>
</div>
<div id="outline-container-orgd6e1e6c" class="outline-3">
<h3 id="orgd6e1e6c"><span class="section-number-3">16.2.</span> gs6809 serial IO doesn't work right with PTY and other streams</h3>
</div>
<div id="outline-container-org8714dae" class="outline-3">
<h3 id="org8714dae"><span class="section-number-3">16.3.</span> ampro (Z80/Z80SIO) <b>does</b> work with PTY</h3>
</div>
<div id="outline-container-org441daf4" class="outline-3">
<h3 id="org441daf4"><span class="section-number-3">16.4.</span> Evaluating what is needed for other emulators.</h3>
</div>
</div>
<div id="outline-container-orgda3b464" class="outline-2">
<h2 id="orgda3b464"><span class="section-number-2">17.</span> More project ideas</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org9fbb12a" class="outline-3">
<h3 id="org9fbb12a"><span class="section-number-3">17.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Good excuse for floating point ALU design. Try posit format?
</p>
</div>
</div>
<div id="outline-container-orgd1d77d2" class="outline-3">
<h3 id="orgd1d77d2"><span class="section-number-3">17.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-17-2">
</div>
<div id="outline-container-org4c8e170" class="outline-4">
<h4 id="org4c8e170"><span class="section-number-4">17.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-org4fc30b5" class="outline-4">
<h4 id="org4fc30b5"><span class="section-number-4">17.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-17-2-2">
<p>
How to support ersatz systems?
</p>
</div>
</div>
<div id="outline-container-org9a49a3a" class="outline-4">
<h4 id="org9a49a3a"><span class="section-number-4">17.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org97e574f" class="outline-3">
<h3 id="org97e574f"><span class="section-number-3">17.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-17-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org6ad7e69" class="outline-3">
<h3 id="org6ad7e69"><span class="section-number-3">17.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org4df509b" class="outline-3">
<h3 id="org4df509b"><span class="section-number-3">17.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-17-5">
</div>
<div id="outline-container-orgfedd1a7" class="outline-4">
<h4 id="orgfedd1a7"><span class="section-number-4">17.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org7a4fe66" class="outline-4">
<h4 id="org7a4fe66"><span class="section-number-4">17.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org25547bf" class="outline-3">
<h3 id="org25547bf"><span class="section-number-3">17.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-17-6">
</div>
<div id="outline-container-orgefc08d3" class="outline-4">
<h4 id="orgefc08d3"><span class="section-number-4">17.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-org314af3f" class="outline-4">
<h4 id="org314af3f"><span class="section-number-4">17.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-orgad5dd68" class="outline-4">
<h4 id="orgad5dd68"><span class="section-number-4">17.6.3.</span> CPUs with totally async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgd95e530" class="outline-4">
<h4 id="orgd95e530"><span class="section-number-4">17.6.4.</span> Could use small footprint monitor in asm (gmpmon?)</h4>
</div>
</div>
<div id="outline-container-org48294bd" class="outline-3">
<h3 id="org48294bd"><span class="section-number-3">17.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-17-7">
</div>
<div id="outline-container-org5915ea8" class="outline-4">
<h4 id="org5915ea8"><span class="section-number-4">17.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-17-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-orga0e1947" class="outline-4">
<h4 id="orga0e1947"><span class="section-number-4">17.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-17-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-orgdd3fd19" class="outline-4">
<h4 id="orgdd3fd19"><span class="section-number-4">17.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-17-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org5357f17" class="outline-4">
<h4 id="org5357f17"><span class="section-number-4">17.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-17-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
MAME emulator possibilities?
</p>
</div>
</div>
<div id="outline-container-orgc9469bf" class="outline-4">
<h4 id="orgc9469bf"><span class="section-number-4">17.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-17-7-5">
<p>
Works. Found original prom in a parts stash(!).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2b03f54" class="outline-2">
<h2 id="org2b03f54"><span class="section-number-2">18.</span> David Davies</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org1e16acc" class="outline-3">
<h3 id="org1e16acc"><span class="section-number-3">18.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org70b6990" class="outline-3">
<h3 id="org70b6990"><span class="section-number-3">18.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org01e0cf9" class="outline-3">
<h3 id="org01e0cf9"><span class="section-number-3">18.3.</span> Next hearing 3/30/2023</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-03-11 Sat 06:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
